[Killed] BlockStatement
src/ch5_exercise.js:1:26
-function union_set(a, b) {
-    let result = new Set(a || []);
-    b?.forEach(function (bItem) {
-        result.add(bItem);
-    });
-    return result;
-}
+function union_set(a, b) {}
 
 module.exports = { union_set };
killedBy: All tests
statusReason: > @software-testing-workshop/ch5-exercise@1.0.0 test
> jest


FAIL __tests__/ch5.test.js

  test for union_set

[Killed] ConditionalExpression
src/ch5_exercise.js:2:26
 function union_set(a, b) {
-    let result = new Set(a || []);
+    let result = new Set(true);
     b?.forEach(function (bItem) {
         result.add(bItem);
killedBy: All tests
statusReason: > @software-testing-workshop/ch5-exercise@1.0.0 test
> jest


FAIL __tests__/ch5.test.js

  test for union_set

[Killed] ConditionalExpression
src/ch5_exercise.js:2:26
 function union_set(a, b) {
-    let result = new Set(a || []);
+    let result = new Set(false);
     b?.forEach(function (bItem) {
         result.add(bItem);
killedBy: All tests
statusReason: > @software-testing-workshop/ch5-exercise@1.0.0 test
> jest


FAIL __tests__/ch5.test.js

  test for union_set

[Killed] OptionalChaining
src/ch5_exercise.js:3:5
 function union_set(a, b) {
     let result = new Set(a || []);
-    b?.forEach(function (bItem) {
+    b.forEach(function (bItem) {
         result.add(bItem);
     });
killedBy: All tests
statusReason: > @software-testing-workshop/ch5-exercise@1.0.0 test
> jest


FAIL __tests__/ch5.test.js

  test for union_set

[Killed] BlockStatement
src/ch5_exercise.js:3:33
 function union_set(a, b) {
     let result = new Set(a || []);
-    b?.forEach(function (bItem) {
-        result.add(bItem);
-    });
+    b?.forEach(function (bItem) {});
     return result;
 }
killedBy: All tests
statusReason: > @software-testing-workshop/ch5-exercise@1.0.0 test
> jest


FAIL __tests__/ch5.test.js

  test for union_set
